from datetime import date, timedelta
from faker import Faker

fake = Faker("ru_RU")

def get_tomorrow():
    return (date.today() + timedelta(days=1)).strftime("%d.%m.%Y")

FAQ_ANSWERS = [
    "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
    "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
    "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
    "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
    "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
    "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
    "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
    "Да, обязательно. Всем самокатов! И Москве, и Московской области."
]

TOP_ORDER_DATA = [
    {
        "name": fake.first_name(),
        "surname": fake.last_name(),
        "address": "Москва, улица Сретенский бульвар, дом 1",
        "metro": "Сретенский бульвар",
        "phone": fake.numerify("89#########"),
        "date": get_tomorrow(),
        "rental_period": "сутки",
        "color": "чёрный жемчуг",
        "comment": "Позвонить за час до доставки"
    }
]

BOTTOM_ORDER_DATA = [
    {
        "name": fake.first_name(),
        "surname": fake.last_name(),
        "address": "Москва, улица Сокольническая, дом 10",
        "metro": "Сокольники",
        "phone": fake.numerify("89#########"),
        "date": get_tomorrow(),
        "rental_period": "двое суток",
        "color": "серая безысходность",
        "comment": "Позвонить перед доставкой"
    }
]